Documents/ИзменениеСтатусаШПИРегистрация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ИзменениеСтатусаШПИРегистрация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыШПИРегистрация</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШПИ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШПИ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШПИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыШПИРегистрация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Корреспонденция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппаИсходящейКорреспонденции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СтатусыШПИРегистрация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СтатусыШПИРегистрация</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппаИсходящейКорреспонденции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыШПИРегистрация</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ШПИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШПИ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ИзменениеСтатусаШПИРегистрация/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СтатусыШПИРегистрация
	Движения.СтатусыШПИРегистрация.Записывать = Истина;
	Для Каждого ТекСтрокаШПИ Из ШПИ Цикл
		Движение = Движения.СтатусыШПИРегистрация.Добавить();
		Движение.Период = Дата;
		Движение.ШПИ = ТекСтрокаШПИ.ШПИ;
		Движение.Корреспонденция = ТекСтрокаШПИ.Корреспонденция;
		Движение.ИдентификаторПочты = ТекСтрокаШПИ.ИдентификаторПочты;
		Движение.Статус = ТекСтрокаШПИ.Статус;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
